static/coarse/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         rhoSimpleFoam;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             6000;

deltaT              1;

writeControl        runTime;

writeInterval       1000;

purgeWrite          0;

writeFormat         ascii;

writePrecision      8;

writeCompression    off;

timeFormat          general;

timePrecision       8;

graphFormat         raw;

runTimeModifiable   true;


functions
{
    #includeFunc getExhaustMomentum
    #includeFunc getJetMomentum
    #includeFunc getInletMomentum


    MachNumber
    {
        type               MachNo;
        libs               ("libfieldFunctionObjects.so");
        executeControl     writeTime;
        writeControl       writeTime;
    }

}



// ************************************************************************* //
